k6-logs/experiment-load/v2/k6-test-100uv.log

     ✓ response code was 200
     ✗ request duration should be < 6s
      ↳  9% — ✓ 1 / ✗ 10

     checks.........................: 54.54% 12 out of 22
     data_received..................: 1.9 kB 62 B/s
     data_sent......................: 17 kB  535 B/s
     http_req_blocked...............: avg=99.32ms  min=95.52ms med=100.35ms max=105.36ms p(90)=102.19ms p(95)=103.78ms
     http_req_connecting............: avg=97.89ms  min=94.08ms med=98.81ms  max=103.77ms p(90)=100.62ms p(95)=102.2ms 
   ✗ http_req_duration..............: avg=18.11s   min=4.18s   med=18.15s   max=28.23s   p(90)=28.23s   p(95)=28.23s  
       { expected_response:true }...: avg=18.11s   min=4.18s   med=18.15s   max=28.23s   p(90)=28.23s   p(95)=28.23s  
   ✓ http_req_failed................: 0.00%  0 out of 11
     http_req_receiving.............: avg=364.81µs min=222µs   med=302µs    max=548µs    p(90)=523µs    p(95)=535.5µs 
     http_req_sending...............: avg=25.72µs  min=11µs    med=17µs     max=85µs     p(90)=35µs     p(95)=59.99µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=18.11s   min=4.18s   med=18.15s   max=28.23s   p(90)=28.23s   p(95)=28.23s  
     http_reqs......................: 11     0.354752/s
     iteration_duration.............: avg=18.21s   min=4.27s   med=18.25s   max=28.34s   p(90)=28.34s   p(95)=28.34s  
     iterations.....................: 11     0.354752/s
     vus............................: 89     min=89       max=100
     vus_max........................: 100    min=100      max=100

time="2025-03-17T07:50:57-05:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"